export default function ProblemSolutionSection() {
  return (
    <section className="bg-transparent py-16 lg:py-24" dir="rtl">
      <div className="  px-6 lg:px-12">
        {/* Header */}
        <div className="text-center mb-10">
          <h2 className="text-2xl lg:text-4xl font-bold text-janbik-dark leading-snug mb-5">
            كل دقيقة ورق… تُسحب من وقت الطفل والتقارير الناقصة تصنع الفوضى.
          </h2>
          <p className="text-janbik-gray text-base lg:text-lg leading-relaxed max-w-3xl mx-auto">
            بين المكالمات، الدفاتر، وتعدد المهام… تتحول المربية إلى "منفذة
            قائمة" و يقل وقت الرعاية الحقيقي بدل أن تكون{" "}
            <span className="font-bold text-janbik-gray">
              حاضنة جودة واهتمام بثقة دون توتر.
            </span>{" "}
            <span className="font-bold text-janbik-teal">
              جنبك يعيد ترتيب القواعد:
            </span>{" "}
            مهام واضحة، توثيق سريع، وتنبيهات تمنع الأخطاء قبل أن تتضخم.{" "}
            <span className="font-bold text-janbik-teal">
              كل شيء في لوحة واحدة
            </span>
          </p>
        </div>

        {/* Main image */}
        <div className=" mb-5 ">
          <img
            src="/girl.jpg"
            alt="فريق عمل الحضانة يستخدم جنبك"
            className=" mx-auto rounded-2xl  object-cover"
          />
        </div>

        {/* Comparison cards */}
        <div className=" flex  justify-center items-center gap-4" dir="ltr">
          {/* With Janbik - green */}
          <div className="rounded-xl w-108 border border-janbik-green/30 bg-janbik-green-light p-5 flex flex-col gap-4">
            {/* Card header */}
            
            <div className="flex items-center justify-between gap-3">
               {/* Trending up icon */}
              <svg
                width="29"
                height="16"
                viewBox="0 0 29 16"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M19.2052 3.20025C18.3202 3.20025 17.6051 2.48519 17.6051 1.60012C17.6051 0.715056 18.3202 0 19.2052 0H27.2059C28.0909 0 28.806 0.715056 28.806 1.60012V9.60075C28.806 10.4858 28.0909 11.2009 27.2059 11.2009C26.3208 11.2009 25.6057 10.4858 25.6057 9.60075V5.46543L17.1351 13.9361C16.51 14.5611 15.495 14.5611 14.8699 13.9361L9.6045 8.66568L2.73396 15.5312C2.10891 16.1563 1.09384 16.1563 0.468787 15.5312C-0.156262 14.9062 -0.156262 13.8911 0.468787 13.266L8.46941 5.26541C9.09446 4.64036 10.1095 4.64036 10.7346 5.26541L16.005 10.5358L23.3406 3.20025H19.2052Z"
                  fill="#009999"
                />
              </svg>
              <div className="flex gap-2  items-center">
                 <h3 className="text-janbik-green font-bold text-lg">مع جنبك</h3>
              
              {/* Check circle */}
              <svg
                width="25"
                height="20"
                viewBox="0 0 25 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M22.1875 9.6875C22.1875 15.0391 17.8125 19.375 12.5 19.375C7.14844 19.375 2.8125 15.0391 2.8125 9.6875C2.8125 4.375 7.14844 0 12.5 0C17.8125 0 22.1875 4.375 22.1875 9.6875ZM11.3672 14.8438L18.5547 7.65625C18.7891 7.42188 18.7891 6.99219 18.5547 6.75781L17.6562 5.89844C17.4219 5.625 17.0312 5.625 16.7969 5.89844L10.9375 11.7578L8.16406 9.02344C7.92969 8.75 7.53906 8.75 7.30469 9.02344L6.40625 9.88281C6.17188 10.1172 6.17188 10.5469 6.40625 10.7812L10.4688 14.8438C10.7031 15.0781 11.1328 15.0781 11.3672 14.8438Z"
                  fill="#1A9E83"
                />
              </svg>

              </div>
             
             
            </div>

            {/* Items */}
            <ul className="flex flex-col gap-3">
              <li className="flex items-center justify-end gap-3">
                <span className="text-janbik-gray text-sm text-right">
                  كل شيء مُوثّق لحظيًا… لا يعتمد على الذاكرة
                </span>
                <svg
                  width="20"
                  height="16"
                  viewBox="0 0 20 16"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  className="shrink-0"
                >
                  <path
                    d="M11 4.25C11 4.6875 11.3125 5 11.75 5H16V15.25C16 15.6875 15.6562 16 15.25 16H4.75C4.3125 16 4 15.6875 4 15.25V0.75C4 0.34375 4.3125 0 4.75 0H11V4.25ZM13 11.625V11.375C13 11.1875 12.8125 11 12.625 11H7.375C7.15625 11 7 11.1875 7 11.375V11.625C7 11.8438 7.15625 12 7.375 12H12.625C12.8125 12 13 11.8438 13 11.625ZM13 9.625V9.375C13 9.1875 12.8125 9 12.625 9H7.375C7.15625 9 7 9.1875 7 9.375V9.625C7 9.84375 7.15625 10 7.375 10H12.625C12.8125 10 13 9.84375 13 9.625ZM13 7.375C13 7.1875 12.8125 7 12.625 7H7.375C7.15625 7 7 7.1875 7 7.375V7.625C7 7.84375 7.15625 8 7.375 8H12.625C12.8125 8 13 7.84375 13 7.625V7.375ZM16 3.8125V4H12V0H12.1875C12.375 0 12.5625 0.09375 12.7188 0.21875L15.7812 3.28125C15.9062 3.4375 16 3.625 16 3.8125Z"
                    fill="#1A9E83"
                  />
                </svg>
              </li>
              <li className="flex items-center justify-end gap-3">
                <span className="text-janbik-gray text-sm text-right">
                  جودة أعلى بعدد أقل… لأن العمل أصبح أسهل وأوضح
                </span>
                <svg
                  width="18"
                  height="10"
                  viewBox="0 0 18 10"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  className="shrink-0"
                >
                  <path
                    d="M12.0033 2.00016C11.4501 2.00016 11.0032 1.55325 11.0032 1.00008C11.0032 0.44691 11.4501 0 12.0033 0H17.0037C17.5568 0 18.0037 0.44691 18.0037 1.00008V6.00047C18.0037 6.55364 17.5568 7.00055 17.0037 7.00055C16.4505 7.00055 16.0036 6.55364 16.0036 6.00047V3.41589L10.7094 8.71006C10.3188 9.10071 9.68435 9.10071 9.29369 8.71006L6.00281 5.41605L1.70873 9.70701C1.31807 10.0977 0.683647 10.0977 0.292992 9.70701C-0.0976639 9.31635 -0.0976639 8.68193 0.292992 8.29127L5.29338 3.29088C5.68404 2.90023 6.31846 2.90023 6.70912 3.29088L10.0031 6.58489L14.5879 2.00016H12.0033Z"
                    fill="#009999"
                  />
                </svg>
              </li>
              <li className="flex items-center justify-end gap-3">
                <span className="text-janbik-gray text-sm text-right">
                  إدارة ترى الصورة كاملة: الأداء + الحوادث + التحسن...
                </span>
                <svg
                  width="20"
                  height="12"
                  viewBox="0 0 20 12"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  className="shrink-0"
                >
                  <path
                    d="M18.8906 5.5625C18.9531 5.6875 18.9844 5.84375 18.9844 6.03125C18.9844 6.1875 18.9531 6.34375 18.8906 6.46875C17.2031 9.78125 13.8281 12 10.0156 12C6.17188 12 2.79688 9.78125 1.10938 6.46875C1.04688 6.34375 1.01562 6.1875 1.01562 6C1.01562 5.84375 1.04688 5.6875 1.10938 5.5625C2.79688 2.25 6.17188 0 10.0156 0C13.8281 0 17.2031 2.25 18.8906 5.5625ZM10.0156 10.5V10.5312C12.4844 10.5312 14.5156 8.5 14.5156 6.03125V6C14.5156 3.53125 12.4844 1.5 10.0156 1.5C7.51562 1.5 5.51562 3.53125 5.51562 6C5.51562 8.5 7.51562 10.5 10.0156 10.5ZM10.0156 3V3.03125C11.6719 3.03125 13.0156 4.34375 13.0156 6C13.0156 7.65625 11.6719 9 10.0156 9C8.35938 9 7.01562 7.65625 7.01562 6C7.01562 5.75 7.04688 5.46875 7.10938 5.21875C7.35938 5.40625 7.67188 5.5 8.01562 5.5C8.82812 5.5 9.48438 4.84375 9.48438 4.03125C9.48438 3.6875 9.39062 3.375 9.20312 3.125C9.45312 3.0625 9.73438 3.03125 10.0156 3Z"
                    fill="#1A9E83"
                  />
                </svg>
              </li>
            </ul>
          </div>

          {/* Without Janbik - red */}
          <div className="rounded-xl w-108 border border-janbik-red/30 bg-janbik-red-light p-5 flex flex-col gap-4">
            {/* Card header */}
            <div className="flex items-center justify-between gap-3">
               {/* Trending down icon */}
              <svg
                width="29"
                height="16"
                viewBox="0 0 29 16"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M19.2052 12.7998C18.3202 12.7998 17.6051 13.5148 17.6051 14.3999C17.6051 15.2849 18.3202 16 19.2052 16H27.2059C28.0909 16 28.806 15.2849 28.806 14.3999V6.39925C28.806 5.51418 28.0909 4.79912 27.2059 4.79912C26.3208 4.79912 25.6057 5.51418 25.6057 6.39925V10.5346L17.1351 2.06391C16.51 1.43886 15.495 1.43886 14.8699 2.06391L9.6045 7.33432L2.73396 0.468787C2.10891 -0.156261 1.09384 -0.156261 0.468787 0.468787C-0.156262 1.09384 -0.156262 2.10892 0.468787 2.73396L8.46941 10.7346C9.09446 11.3596 10.1095 11.3596 10.7346 10.7346L16.005 5.46418L23.3406 12.7998H19.2052Z"
                  fill="#BB1B1B"
                />
              </svg>
              <div className="flex items-center gap-2 ">
                  <h3 className="text-janbik-red font-bold text-lg">بدون جنبك</h3>
              {/* X circle */}
              <svg
                width="25"
                height="20"
                viewBox="0 0 25 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M12.5 0C17.8516 0 22.1875 4.33594 22.1875 9.6875C22.1875 15.0391 17.8516 19.375 12.5 19.375C7.14844 19.375 2.8125 15.0391 2.8125 9.6875C2.8125 4.33594 7.14844 0 12.5 0ZM17.2266 12.2656L14.6875 9.6875L17.2266 7.14844C17.4219 6.99219 17.4219 6.67969 17.2266 6.48438L15.7031 4.96094C15.5078 4.76562 15.1953 4.76562 15.0391 4.96094L12.5 7.5L9.96094 4.96094C9.76562 4.76562 9.45312 4.76562 9.29688 4.96094L7.73438 6.48438C7.53906 6.67969 7.53906 6.99219 7.73438 7.14844L10.3125 9.6875L7.73438 12.2266C7.53906 12.4219 7.53906 12.7344 7.73438 12.8906L9.25781 14.4531C9.45312 14.6484 9.76562 14.6484 9.92188 14.4531L12.5 11.875L15.0391 14.4531C15.1953 14.6484 15.5078 14.6484 15.7031 14.4531L17.2266 12.9297C17.4219 12.7344 17.4219 12.4219 17.2266 12.2656Z"
                  fill="#BB1B1B"
                />
              </svg>

              </div>
            
             
            </div>

            {/* Items */}
            <ul className="flex flex-col gap-3">
              <li className="flex items-center justify-end gap-3">
                <span className="text-janbik-gray text-sm text-right">
                  تشتت + صعوبة معرفة "ماذا حدث ومتى؟"
                </span>
                <svg
                  width="20"
                  height="16"
                  viewBox="0 0 20 16"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  className="shrink-0"
                >
                  <path
                    d="M18.7968 13.7696C19.3593 14.7696 18.6406 15.9883 17.4843 15.9883H2.51559C1.35934 15.9883 0.640587 14.7383 1.20309 13.7696L8.70309 0.738328C9.26559 -0.261672 10.7343 -0.230422 11.2968 0.738328L18.7968 13.7696ZM10.0156 11.0508C9.20309 11.0508 8.57809 11.7071 8.57809 12.4883C8.57809 13.3008 9.20309 13.9258 10.0156 13.9258C10.7968 13.9258 11.4531 13.3008 11.4531 12.4883C11.4531 11.7071 10.7968 11.0508 10.0156 11.0508ZM8.64059 5.89458L8.85934 10.1446C8.89059 10.3633 9.04684 10.4883 9.23434 10.4883H10.7656C10.9531 10.4883 11.1093 10.3633 11.1406 10.1446L11.3593 5.89458C11.3906 5.67583 11.2031 5.48833 10.9843 5.48833H9.01559C8.79684 5.48833 8.60934 5.67583 8.64059 5.89458Z"
                    fill="#BB1B1B"
                  />
                </svg>
              </li>
              <li className="flex items-center justify-end gap-3">
                <span className="text-janbik-gray text-sm text-right">
                  ضغط على الموظفين = جودة أقل رغم العدد الأكبر
                </span>
                <svg
                  width="20"
                  height="14"
                  viewBox="0 0 20 14"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  className="shrink-0"
                >
                  <path
                    d="M3 6C1.875 6 1 5.125 1 4C1 2.90625 1.875 2 3 2C4.09375 2 5 2.90625 5 4C5 5.125 4.09375 6 3 6ZM17 6C15.875 6 15 5.125 15 4C15 2.90625 15.875 2 17 2C18.0938 2 19 2.90625 19 4C19 5.125 18.0938 6 17 6ZM18 7C19.0938 7 20 7.90625 20 9V10C20 10.5625 19.5312 11 19 11H16.9375C16.7188 9.53125 15.8438 8.28125 14.5625 7.59375C14.9375 7.25 15.4375 7 16 7H18ZM10 7C8.0625 7 6.5 5.4375 6.5 3.5C6.5 1.59375 8.0625 0 10 0C11.9062 0 13.5 1.59375 13.5 3.5C13.5 5.4375 11.9062 7 10 7ZM12.375 8C14.375 8 16 9.625 16 11.625V12.5C16 13.3438 15.3125 14 14.5 14H5.5C4.65625 14 4 13.3438 4 12.5V11.625C4 9.625 5.59375 8 7.59375 8H7.84375C8.5 8.3125 9.21875 8.5 10 8.5C10.75 8.5 11.4688 8.3125 12.125 8H12.375ZM5.40625 7.59375C4.125 8.28125 3.25 9.53125 3.03125 11H1C0.4375 11 0 10.5625 0 10V9C0 7.90625 0.875 7 2 7H4C4.53125 7 5.03125 7.25 5.40625 7.59375Z"
                    fill="#BB1B1B"
                  />
                </svg>
              </li>
              <li className="flex items-center justify-end gap-3">
                <span className="text-janbik-gray text-sm text-right">
                  تقارير متأخرة = قرارات متأخرة
                </span>
                <svg
                  width="16"
                  height="16"
                  viewBox="0 0 16 16"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                  className="shrink-0"
                >
                  <path
                    d="M7.75 0C12.0312 0 15.5 3.46875 15.5 7.75C15.5 12.0312 12.0312 15.5 7.75 15.5C3.46875 15.5 0 12.0312 0 7.75C0 3.46875 3.46875 0 7.75 0ZM10.625 9.78125C10.6875 9.71875 10.75 9.59375 10.75 9.46875C10.75 9.3125 10.6562 9.1875 10.5625 9.09375L8.75 7.75V3.25C8.75 3 8.5 2.75 8.25 2.75H7.25C6.96875 2.75 6.75 3 6.75 3.25V8.125C6.75 8.53125 6.90625 8.875 7.21875 9.09375L9.3125 10.6562C9.375 10.7188 9.5 10.7812 9.59375 10.7812C9.78125 10.7812 9.90625 10.6875 10 10.5625L10.625 9.78125Z"
                    fill="#BB1B1B"
                  />
                </svg>
              </li>
            </ul>
          </div>
        </div>
      </div>
    </section>
  );
}

